var FormatUnicode = new RegExp("^[A-z]([A-z0-9-]*)+$");
var FormatUser = new RegExp("^[A-z]([A-z0-9]*)+$");
var FormatPin = new RegExp("^[0-9]+$");
var FormatRoll = new RegExp("^([A-z0-9 -]*)+$");
var FormatFName = new RegExp("^([a-zA-Z0-9 ẮẰẲẴẶĂẤẦẨẪẬÂÁÀÃẢẠĐẾỀỂỄỆÊÉÈẺẼẸÍÌỈĨỊỐỒỔỖỘÔỚỜỞỠỢƠÓÒÕỎỌỨỪỬỮỰƯÚÙỦŨỤÝỲỶỸỴắằẳẵặăấầẩẫậâáàãảạđếềểễệêéèẻẽẹíìỉĩịốồổỗộôớờởỡợơóòõỏọứừửữựưúùủũụýỳỷỹỵ]*)([a-zA-Z0-9 ẮẰẲẴẶĂẤẦẨẪẬÂÁÀÃẢẠĐẾỀỂỄỆÊÉÈẺẼẸÍÌỈĨỊỐỒỔỖỘÔỚỜỞỠỢƠÓÒÕỎỌỨỪỬỮỰƯÚÙỦŨỤÝỲỶỸỴắằẳẵặăấầẩẫậâáàãảạđếềểễệêéèẻẽẹíìỉĩịốồổỗộôớờởỡợơóòõỏọứừửữựưúùủũụýỳỷỹỵ]*)+$");
var FormatPass = new RegExp("^(?=.*[a-z])(?=.*[A-Z])(?=.*[0-9])(?=.*[!@#\$%\^&\*])");
//var regexFName = new RegExp("^[a-zA-Z][a-zA-Z\\s]+$");
var FormatEmail = /^\w+([-+.']\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/;
var FormatNumber = new RegExp("^(0|[1-9][0-9]*)$");
var FormatNumberFloat = /^-?\d*(\.\d+)?$/;
var FormatCurrency = /^\d+(?:\.\d{1,8})?$/;
var FormatKeyword = /^[a-zA-Z0-9 ẮẰẲẴẶĂẤẦẨẪẬÂÁÀÃẢẠĐẾỀỂỄỆÊÉÈẺẼẸÍÌỈĨỊỐỒỔỖỘÔỚỜỞỠỢƠÓÒÕỎỌỨỪỬỮỰƯÚÙỦŨỤÝỲỶỸỴắằẳẵặăấầẩẫậâáàãảạđếềểễệêéèẻẽẹíìỉĩịốồổỗộôớờởỡợơóòõỏọứừửữựưúùủũụýỳỷỹỵ,.:'-]+$/u;
//var regexFName = /^[a-zA-Z0-9 ẮẰẲẴẶĂẤẦẨẪẬÂÁÀÃẢẠĐẾỀỂỄỆÊÉÈẺẼẸÍÌỈĨỊỐỒỔỖỘÔỚỜỞỠỢƠÓÒÕỎỌỨỪỬỮỰƯÚÙỦŨỤÝỲỶỸỴắằẳẵặăấầẩẫậâáàãảạđếềểễệêéèẻẽẹíìỉĩịốồổỗộôớờởỡợơóòõỏọứừửữựưúùủũụýỳỷỹỵ,.'-]+$/u;
var FormatDomain = /^[a-zA-Z0-9][a-zA-Z0-9-]{1,61}[a-zA-Z0-9](?:\.[a-zA-Z]{2,})+$/u;
var FormatNegative = new RegExp("^-?[0-9]+$");
//var regexNegative = new RegExp("^-?[0-9]\d*(\.\d+)?$");
var FormatKeyId = /^[a-zA-Z0-9-]+$/;
var FormatDateVN = /^(?:(?:31(\/|-|\.)(?:0?[13578]|1[02]))\1|(?:(?:29|30)(\/|-|\.)(?:0?[1,3-9]|1[0-2])\2))(?:(?:1[6-9]|[2-9]\d)?\d{2})$|^(?:29(\/|-|\.)0?2\3(?:(?:(?:1[6-9]|[2-9]\d)?(?:0[48]|[2468][048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26])00))))$|^(?:0?[1-9]|1\d|2[0-8])(\/|-|\.)(?:(?:0?[1-9])|(?:1[0-2]))\4(?:(?:1[6-9]|[2-9]\d)?\d{2})$/;
var FormatTimeWordShit = /^(0[0-9]|1[0-9]|2[0-3]|[0-9]):[0-5][0-9]$/;
var FormatTimeHhMm = /^([01]\d|2[0-3]):?([0-5]\d)$/;
var FormatTime = /^(?:0?[0-9]|1[0-2]):[0-5][0-9]:[0-5][0-9]$/;
//function IsNumber() {

//}
//var $inputUsd = $('#txtAmountUsd');
//var _inval = $inputUsd.val();
//if (_inval != '') {
//    _inval = _inval.replace(/[^0-9.]+/g, '');
//    $inputUsd.val(_inval);
var FormatPhone = /^((\+84)|(09|01[2|6|8|9]))+([0-9]{8,12})\b$/;
var FormatTel = /^((\+\d{1,3}(-| )?\(?\d\)?(-| )?\d{1,3})|(\(?\d{2,3}\)?))(-| )?(\d{3,4})(-| )?(\d{4})(( x| ext)\d{1,5}){0,1}$/;


//

//var regexPhone = /^\+?([0-9]{2})\)?[-. ]?([0-9]{4})[-. ]?([0-9]{4})$/;
//var regexPhone =  /^(1\s|1|)?((\(\d{3}\))|\d{3})(\-|\s)?(\d{3})(\-|\s)?(\d{4})$/;
//var regexPhone = /^0(1\d{9}|9\d{8})$/;